# FamilyParameterSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameterSetIterator Class
Members See Also
---
An iterator to a FamilyParameter set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class FamilyParameterSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class FamilyParameterSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class FamilyParameterSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FamilyParameterSetIterator
# See Also
FamilyParameterSetIterator Members
Autodesk.Revit.DB Namespace